STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.h
/**
  **********************************************************************************************************************
  * @file    stm32u5xx_hal_flash_itf.h
  * @brief   Header file of FLASH interface HAL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32U5XX_HAL_FLASH_ITF_H
#define STM32U5XX_HAL_FLASH_ITF_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32u5xx_hal_def.h"
#include "stm32u5xx_ll_flash.h"

/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */

/** @defgroup FLASH_ITF FLASH Interface
  * @{
  */
/* Exported Constants ------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_ITF_Exported_Constants FLASH Interface Exported Constants
  * @{
  */
#define HAL_FLASH_ITF_OB_STOP_MODE     1U /*!< FLASH ITF OB stop mode     */
#define HAL_FLASH_ITF_OB_STANDBY_MODE  2U /*!< FLASH ITF OB standby mode  */
#define HAL_FLASH_ITF_OB_SHUTDOWN_MODE 4U /*!< FLASH ITF OB shutdown mode */

#define HAL_FLASH_ITF_OB_BKPRAM        1U /*!< FLASH ITF OB BKPRAM        */
#define HAL_FLASH_ITF_OB_SRAM2         2U /*!< FLASH ITF OB SRAM2         */
#if defined (SRAM3_BASE)
#define HAL_FLASH_ITF_OB_SRAM3         4U /*!< FLASH ITF OB SRAM3         */
#endif /* SRAM3_BASE */
#define HAL_FLASH_ITF_OB_SRAM          8U /*!< FLASH ITF OB SRAM          */

#define HAL_FLASH_ITF_OB_PA15          0U /*!< FLASH ITF OB PA15 pin      */

#define HAL_FLASH_ITF_OB_VDDIO         1U /*!< FLASH ITF OB VDDIO         */
#define HAL_FLASH_ITF_OB_VDDIO2        2U /*!< FLASH ITF OB VDDIO2        */

/**
  * @}
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_ITF_Exported_Types FLASH Interface Exported Types
  * @{
  */

/*! HAL FLASH ITF lock status enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_UNLOCKED = 0U, /*!< FLASH unlocked */
  HAL_FLASH_ITF_LOCKED   = 1U  /*!< FLASH locked   */
} hal_flash_itf_lock_status_t;

/*! HAL FLASH ITF latency enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_LATENCY_0  = LL_FLASH_LATENCY_0WS,  /*!< FLASH ITF zero wait state      */
  HAL_FLASH_ITF_LATENCY_1  = LL_FLASH_LATENCY_1WS,  /*!< FLASH ITF one wait state       */
  HAL_FLASH_ITF_LATENCY_2  = LL_FLASH_LATENCY_2WS,  /*!< FLASH ITF two wait states      */
  HAL_FLASH_ITF_LATENCY_3  = LL_FLASH_LATENCY_3WS,  /*!< FLASH ITF three wait states    */
  HAL_FLASH_ITF_LATENCY_4  = LL_FLASH_LATENCY_4WS,  /*!< FLASH ITF four wait states     */
  HAL_FLASH_ITF_LATENCY_5  = LL_FLASH_LATENCY_5WS,  /*!< FLASH ITF five wait states     */
  HAL_FLASH_ITF_LATENCY_6  = LL_FLASH_LATENCY_6WS,  /*!< FLASH ITF six wait states      */
  HAL_FLASH_ITF_LATENCY_7  = LL_FLASH_LATENCY_7WS,  /*!< FLASH ITF seven wait states    */
  HAL_FLASH_ITF_LATENCY_8  = LL_FLASH_LATENCY_8WS,  /*!< FLASH ITF eight wait states    */
  HAL_FLASH_ITF_LATENCY_9  = LL_FLASH_LATENCY_9WS,  /*!< FLASH ITF nine wait states     */
  HAL_FLASH_ITF_LATENCY_10 = LL_FLASH_LATENCY_10WS, /*!< FLASH ITF ten wait states      */
  HAL_FLASH_ITF_LATENCY_11 = LL_FLASH_LATENCY_11WS, /*!< FLASH ITF eleven wait states   */
  HAL_FLASH_ITF_LATENCY_12 = LL_FLASH_LATENCY_12WS, /*!< FLASH ITF twelve wait states   */
  HAL_FLASH_ITF_LATENCY_13 = LL_FLASH_LATENCY_13WS, /*!< FLASH ITF thirteen wait states */
  HAL_FLASH_ITF_LATENCY_14 = LL_FLASH_LATENCY_14WS, /*!< FLASH ITF fourteen wait states */
  HAL_FLASH_ITF_LATENCY_15 = LL_FLASH_LATENCY_15WS  /*!< FLASH ITF fifteen wait states  */
} hal_flash_itf_latency_t;

/*! HAL FLASH ITF Prefetch enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_PREFETCH_DISABLED  = 0U, /*!< FLASH ITF prefetch disabled */
  HAL_FLASH_ITF_PREFETCH_ENABLED   = 1U  /*!< FLASH ITF prefetch enabled  */
} hal_flash_itf_prefetch_status_t;

/*! HAL FLASH ITF power down in run mode enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_PWR_DOWN_RUN_DISABLED = 0U, /*!< FLASH ITF power-down in run mode disabled */
  HAL_FLASH_ITF_PWR_DOWN_RUN_ENABLED  = 1U  /*!< FLASH ITF power-down in run mode enabled  */
} hal_flash_itf_pwr_down_run_status_t;

/*! HAL FLASH ITF power down in sleep mode enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_PWR_DOWN_SLEEP_DISABLED = 0U, /*!< FLASH ITF power-down in sleep mode disabled */
  HAL_FLASH_ITF_PWR_DOWN_SLEEP_ENABLED  = 1U  /*!< FLASH ITF power-down in sleep mode enabled  */
} hal_flash_itf_pwr_down_sleep_status_t;

/*! HAL FLASH ITF low power in read mode enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_LOW_PWR_READ_DISABLED = 0U, /*!< FLASH ITF low power in read mode disabled */
  HAL_FLASH_ITF_LOW_PWR_READ_ENABLED  = 1U  /*!< FLASH ITF low power in read mode enabled  */
} hal_flash_itf_low_pwr_read_status_t;

/*! HAL FLASH ITF ECC interrupt status enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_ECC_IT_DISABLED = 0U, /*!< FLASH ITF ECC interrupt disabled */
  HAL_FLASH_ITF_ECC_IT_ENABLED  = 1U  /*!< FLASH ITF ECC interrupt enabled  */
} hal_flash_itf_ecc_it_status_t;

/*! HAL FLASH ITF Readout Protection key lock status enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_RDP_KEY_UNLOCKED = 0x0U, /*!< FLASH ITF Readout Protection OEM key unlocked */
  HAL_FLASH_ITF_RDP_KEY_LOCKED   = 0x1U  /*!< FLASH ITF Readout Protection OEM key locked   */
} hal_flash_itf_rdp_key_lock_status_t;

/*! HAL FLASH ITF OB lock status enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_UNLOCKED = 0U, /*!< FLASH ITF OB unlocked */
  HAL_FLASH_ITF_OB_LOCKED   = 1U  /*!< FLASH ITF OB locked   */
} hal_flash_itf_ob_lock_status_t;

/*! HAL FLASH ITF OB bank enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_BANK_1 = LL_FLASH_BANK_1, /*!< FLASH ITF OB Bank 1 */
  HAL_FLASH_ITF_BANK_2 = LL_FLASH_BANK_2  /*!< FLASH ITF OB Bank 1 */
} hal_flash_itf_bank_t;

