STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.h
/*! HAL FLASH ITF OB Area enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_BANK_AREA_A = LL_FLASH_OB_BANK_AREA_A, /*!< FLASH ITF OB Bank Area A */
  HAL_FLASH_ITF_OB_BANK_AREA_B = LL_FLASH_OB_BANK_AREA_B  /*!< FLASH ITF OB Bank Area B */
} hal_flash_itf_ob_bank_area_t;

/*! HAL FLASH ITF OB write protection lock status enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_WRP_UNLOCKED = 0U, /*!< FLASH ITF OB Write protection unlocked */
  HAL_FLASH_ITF_OB_WRP_LOCKED   = 1U  /*!< FLASH ITF OB Write protection locked   */
} hal_flash_itf_ob_wrp_lock_status_t;

/*! HAL FLASH ITF OB Read Protection level enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_RDP_LEVEL_0   = LL_FLASH_OB_RDP_LEVEL_0,   /*!< FLASH ITF OB Read protection level 0   */
  HAL_FLASH_ITF_OB_RDP_LEVEL_0_5 = LL_FLASH_OB_RDP_LEVEL_0_5, /*!< FLASH ITF OB Read protection level 0.5 */
  HAL_FLASH_ITF_OB_RDP_LEVEL_1   = LL_FLASH_OB_RDP_LEVEL_1,   /*!< FLASH ITF OB Read protection level 1   */
  HAL_FLASH_ITF_OB_RDP_LEVEL_2   = LL_FLASH_OB_RDP_LEVEL_2    /*!< FLASH ITF OB Read protection level 2   */
} hal_flash_itf_ob_rdp_level_t;

/*! HAL FLASH ITF OB BOR Level enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_BOR_LEVEL_0 = LL_FLASH_OB_BOR_LEVEL_0, /*!< FLASH ITF OB BOR level 0 */
  HAL_FLASH_ITF_OB_BOR_LEVEL_1 = LL_FLASH_OB_BOR_LEVEL_1, /*!< FLASH ITF OB BOR level 1 */
  HAL_FLASH_ITF_OB_BOR_LEVEL_2 = LL_FLASH_OB_BOR_LEVEL_2, /*!< FLASH ITF OB BOR level 2 */
  HAL_FLASH_ITF_OB_BOR_LEVEL_3 = LL_FLASH_OB_BOR_LEVEL_3, /*!< FLASH ITF OB BOR level 3 */
  HAL_FLASH_ITF_OB_BOR_LEVEL_4 = LL_FLASH_OB_BOR_LEVEL_4  /*!< FLASH ITF OB BOR level 4 */
} hal_flash_itf_ob_bor_level_t;

/*! HAL FLASH ITF OB reset generation when enter in low power mode enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_RST_GENERATION    = 0U, /*!< FLASH ITF OB reset generation when enter in low power mode    */
  HAL_FLASH_ITF_OB_NO_RST_GENERATION = 1U  /*!< FLASH ITF OB no reset generation when enter in low power mode */
} hal_flash_itf_ob_rst_generation_status_t;

/*! HAL FLASH ITF OB Erased sram when system reset enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_SYS_RST_SRAM_ERASE    = 0U, /*!< FLASH ITF OB Erased SRAM when system reset occurs    */
  HAL_FLASH_ITF_OB_SYS_RST_SRAM_NO_ERASE = 1U  /*!< FLASH ITF OB No erased SRAM when system reset occurs */
} hal_flash_itf_ob_sys_rst_sram_erase_t;

/*! HAL FLASH ITF OB WDG hardware/software mode enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_WDG_HARDWARE = 0U, /*!< FLASH ITF OB WDG hardware select */
  HAL_FLASH_ITF_OB_WDG_SOFTWARE = 1U  /*!< FLASH ITF OB WDG software select */
} hal_flash_itf_ob_wdg_mode_t;

/*! HAL FLASH ITF OB WDG counter low power mode freeze enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_WDG_FROZEN   = 1U, /*!< FLASH ITF OB WDG counter low power mode frozen  */
  HAL_FLASH_ITF_OB_WDG_UNFROZEN = 0U  /*!< FLASH ITF OB WDG counter low power mode running */
} hal_flash_itf_ob_wdg_freeze_status_t;

/*! HAL FLASH ITF OB Swapping bank enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_BANK_NO_SWAP = LL_FLASH_OB_BANK_NOT_SWAPPED, /*!< FLASH ITF OB Bank not swapped */
  HAL_FLASH_ITF_OB_BANK_SWAP    = LL_FLASH_OB_BANK_SWAPPED      /*!< FLASH ITF OB Bank swapped     */
} hal_flash_itf_ob_bank_swap_t;

/*! HAL FLASH ITF OB Single/Dual bank enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_SINGLE_BANK = LL_FLASH_OB_SINGLE_BANK, /*!< FLASH ITF OB Single bank */
  HAL_FLASH_ITF_OB_DUAL_BANK   = LL_FLASH_OB_DUAL_BANK    /*!< FLASH ITF OB Dual bank   */
} hal_flash_itf_ob_topology_t ;

/*! HAL FLASH ITF OB SRAM ECC enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_SRAM_ECC_DISABLED = 0U, /*!< FLASH ITF OB SRAM ECC disable */
  HAL_FLASH_ITF_OB_SRAM_ECC_ENABLED  = 1U  /*!< FLASH ITF OB SRAM ECC enable  */
} hal_flash_itf_ob_sram_ecc_status_t ;

/*! HAL FLASH ITF OB Software boot0 selection enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_BOOT_PIN        = LL_FLASH_OB_BOOT0_BOOTPIN, /*!< FLASH ITF OB boot taken from boot pin */
  HAL_FLASH_ITF_OB_BOOT_OPTION_BIT = LL_FLASH_OB_BOOT0_NBOOTBIT /*!< FLASH ITF OB boot taken from boot bit */
} hal_flash_itf_ob_boot_selection_t;

/*! HAL FLASH ITF OB Software boot0 state enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_BOOT_LOW  = LL_FLASH_OB_BOOT0_LOW, /*!< FLASH ITF OB boot taken from boot address 0 */
  HAL_FLASH_ITF_OB_BOOT_HIGH = LL_FLASH_OB_BOOT0_HIGH /*!< FLASH ITF OB boot taken from boot address 1 */
} hal_flash_itf_ob_boot_state_t;

/*! HAL FLASH ITF OB pull mode enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_PULL_NO   = 0U, /*!< FLASH ITF OB no pull   */
  HAL_FLASH_ITF_OB_PULL_DOWN = 1U, /*!< FLASH ITF OB pull down */
  HAL_FLASH_ITF_OB_PULL_UP   = 2U  /*!< FLASH ITF OB pull up   */
} hal_flash_itf_ob_pull_mode_t;

/*! HAL FLASH ITF OB pin pull enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_PIN_PULL_DISABLED = 0U, /*!< FLASH ITF OB pullup pin disable */
  HAL_FLASH_ITF_OB_PIN_PULL_ENABLED  = 1U  /*!< FLASH ITF OB pullup pin enable  */
} hal_flash_itf_ob_pin_pull_status_t;

/*! HAL FLASH ITF OB VDDI HSLV enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_VDDX_HSLV_DISABLED = 0U, /*!< FLASH ITF OB VDD HSLV disable */
  HAL_FLASH_ITF_OB_VDDX_HSLV_ENABLED  = 1U  /*!< FLASH ITF OB VDD HSLV enable  */
} hal_flash_itf_ob_vddx_hslv_status_t;

/*! HAL FLASH ITF OB TrustZone enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_TRUSTZONE_DISABLED = 0U, /*!< FLASH ITF OB TrustZone disabled */
  HAL_FLASH_ITF_OB_TRUSTZONE_ENABLED  = 1U  /*!< FLASH ITF OB TrustZone enabled  */
} hal_flash_itf_ob_trustzone_status_t;

/*! HAL FLASH ITF OB address enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_ADDR_0 = 0U, /*!< FLASH ITF OB address 0 */
  HAL_FLASH_ITF_OB_ADDR_1 = 1U  /*!< FLASH ITF OB address 1 */
} hal_flash_itf_ob_addr_idx_t;

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/*! HAL FLASH ITF OB hide protection area enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_HDP_AREA_DISABLED = 0U, /*!< FLASH ITF OB hide protection area disabled */
  HAL_FLASH_ITF_OB_HDP_AREA_ENABLED  = 1U  /*!< FLASH ITF OB hide protection area enabled  */
} hal_flash_itf_ob_hdp_area_status_t;

