STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.h
/*! HAL FLASH ITF OB boot address lock status enumeration definition */
typedef enum
{
  HAL_FLASH_ITF_OB_BOOT_UNLOCKED = 0U, /*!< FLASH ITF OB boot unlocked */
  HAL_FLASH_ITF_OB_BOOT_LOCKED   = 1U  /*!< FLASH ITF OB boot locked   */
} hal_flash_itf_ob_boot_lock_status_t;
#endif /* __ARM_FEATURE_CMSE */

/*! HAL FLASH ITF OB Readout Protection OEM key structure definition */
typedef struct
{
  uint32_t key_w1; /*!< FLASH ITF OB OEM Key low bytes */
  uint32_t key_w2; /*!< FLASH ITF OB OEM Key high bytes */
} hal_flash_itf_ob_rdp_oem_key_t;

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup FLASH_ITF_Exported_Functions FLASH Interface Exported Functions
  * @{
  */

/** @defgroup FLASH_ITF_Exported_Functions_Group1 FLASH Interface Lock and Unlock functions
  * @{
  */
hal_status_t HAL_FLASH_ITF_Lock(FLASH_TypeDef *flash);
hal_status_t HAL_FLASH_ITF_Unlock(FLASH_TypeDef *flash);
hal_flash_itf_lock_status_t HAL_FLASH_ITF_IsLocked(const FLASH_TypeDef *flash);

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
hal_status_t HAL_FLASH_ITFNS_Lock(FLASH_TypeDef *flash);
hal_status_t HAL_FLASH_ITFNS_Unlock(FLASH_TypeDef *flash);
hal_flash_itf_lock_status_t HAL_FLASH_ITFNS_IsLocked(const FLASH_TypeDef *flash);
#endif /* __ARM_FEATURE_CMSE */

hal_status_t HAL_FLASH_ITF_OB_Lock(FLASH_TypeDef *flash);
hal_status_t HAL_FLASH_ITF_OB_Unlock(FLASH_TypeDef *flash);
hal_flash_itf_ob_lock_status_t HAL_FLASH_ITF_OB_IsLocked(const FLASH_TypeDef *flash);
/**
  * @}
  */

/** @defgroup FLASH_ITF_Exported_Functions_Group2 FLASH Interface control functions
  * @{
  */
hal_status_t HAL_FLASH_ITF_SetLatency(FLASH_TypeDef *flash, hal_flash_itf_latency_t latency);
hal_flash_itf_latency_t HAL_FLASH_ITF_GetLatency(const FLASH_TypeDef *flash);

hal_status_t HAL_FLASH_ITF_EnablePrefetch(FLASH_TypeDef *flash);
hal_status_t HAL_FLASH_ITF_DisablePrefetch(FLASH_TypeDef *flash);
hal_flash_itf_prefetch_status_t HAL_FLASH_ITF_IsEnabledPrefetch(const FLASH_TypeDef *flash);

hal_status_t HAL_FLASH_ITF_EnablePWRDownRunMode(FLASH_TypeDef *flash, hal_flash_itf_bank_t bank);
hal_flash_itf_pwr_down_run_status_t HAL_FLASH_ITF_IsEnabledRunModePWRDown(const FLASH_TypeDef *flash,
                                                                          const hal_flash_itf_bank_t bank);

hal_status_t HAL_FLASH_ITF_EnablePWRDownSleepMode(FLASH_TypeDef *flash);
hal_status_t HAL_FLASH_ITF_DisablePWRDownSleepMode(FLASH_TypeDef *flash);
hal_flash_itf_pwr_down_sleep_status_t HAL_FLASH_ITF_IsEnabledSleepModePWRDown(const FLASH_TypeDef *flash);

hal_status_t HAL_FLASH_ITF_EnableLowPWRReadMode(FLASH_TypeDef *flash);
hal_status_t HAL_FLASH_ITF_DisableLowPWRReadMode(FLASH_TypeDef *flash);
hal_flash_itf_low_pwr_read_status_t HAL_FLASH_ITF_IsEnabledLowPWRReadMode(const FLASH_TypeDef *flash);

#if defined (USE_HAL_FLASH_ITF_ECC) && (USE_HAL_FLASH_ITF_ECC == 1U)
hal_status_t HAL_FLASH_ITF_ECC_EnableIT(FLASH_TypeDef *flash);
hal_status_t HAL_FLASH_ITF_ECC_DisableIT(FLASH_TypeDef *flash);
hal_flash_itf_ecc_it_status_t HAL_FLASH_ITF_ECC_IsEnabledIT(const FLASH_TypeDef *flash);
#endif /* USE_HAL_FLASH_ITF_ECC */

hal_flash_itf_rdp_key_lock_status_t HAL_FLASH_ITF_IsLockedRDPOEM1Key(const FLASH_TypeDef *flash);
hal_flash_itf_rdp_key_lock_status_t HAL_FLASH_ITF_IsLockedRDPOEM2Key(const FLASH_TypeDef *flash);
/**
  * @}
  */

/** @defgroup FLASH_ITF_Exported_Functions_Group3 FLASH Interface option bytes configuration functions
  * @{
  */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
hal_status_t HAL_FLASH_ITF_OB_SetSecureWMArea(FLASH_TypeDef *flash,
                                              hal_flash_itf_bank_t bank,
                                              uint32_t start_page,
                                              uint32_t page_nbr);
void HAL_FLASH_ITF_OB_GetSecureWMArea(const FLASH_TypeDef *flash,
                                      const hal_flash_itf_bank_t bank,
                                      uint32_t *p_start_page,
                                      uint32_t *p_page_nbr);

hal_status_t HAL_FLASH_ITF_OB_SetConfigHDPArea(FLASH_TypeDef *flash,
                                               hal_flash_itf_bank_t bank,
                                               uint32_t page_nbr);
void HAL_FLASH_ITF_OB_GetConfigHDPArea(const FLASH_TypeDef *flash,
                                       const hal_flash_itf_bank_t bank,
                                       uint32_t *p_page_nbr);

hal_status_t HAL_FLASH_ITF_OB_EnableHDPArea(FLASH_TypeDef *flash, hal_flash_itf_bank_t bank);
hal_status_t HAL_FLASH_ITF_OB_DisableHDPArea(FLASH_TypeDef *flash, hal_flash_itf_bank_t bank);
hal_flash_itf_ob_hdp_area_status_t HAL_FLASH_ITF_OB_IsEnabledHDPArea(const FLASH_TypeDef *flash,
                                                                     const hal_flash_itf_bank_t bank);

hal_status_t HAL_FLASH_ITF_OB_SetSecureBootAddr(FLASH_TypeDef *flash, uint32_t boot_addr);
uint32_t HAL_FLASH_ITF_OB_GetSecureBootAddr(const FLASH_TypeDef *flash);

hal_status_t HAL_FLASH_ITF_OB_LockBootConfig(FLASH_TypeDef *flash);
hal_status_t HAL_FLASH_ITF_OB_UnlockBootConfig(FLASH_TypeDef *flash);
hal_flash_itf_ob_boot_lock_status_t HAL_FLASH_ITF_OB_IsLockedBootConfig(const FLASH_TypeDef *flash);
#endif /* __ARM_FEATURE_CMSE */

hal_status_t HAL_FLASH_ITF_OB_SetWRPArea(FLASH_TypeDef *flash,
                                         hal_flash_itf_bank_t bank,
                                         hal_flash_itf_ob_bank_area_t area,
                                         uint32_t start_page,
                                         uint32_t page_nbr);

void HAL_FLASH_ITF_OB_GetWRPArea(const FLASH_TypeDef *flash,
                                 const hal_flash_itf_bank_t bank,
                                 const hal_flash_itf_ob_bank_area_t area,
                                 uint32_t *p_start_page,
                                 uint32_t *p_page_nbr);

hal_status_t HAL_FLASH_ITF_OB_LockWRPAreaConfig(FLASH_TypeDef *flash,
                                                hal_flash_itf_bank_t bank,
                                                hal_flash_itf_ob_bank_area_t area);
hal_status_t HAL_FLASH_ITF_OB_UnlockWRPAreaConfig(FLASH_TypeDef *flash,
                                                  hal_flash_itf_bank_t bank,
                                                  hal_flash_itf_ob_bank_area_t area);
hal_flash_itf_ob_wrp_lock_status_t HAL_FLASH_ITF_OB_IsLockedWRPAreaConfig(const FLASH_TypeDef *flash,
                                                                          const hal_flash_itf_bank_t bank,
                                                                          const hal_flash_itf_ob_bank_area_t area);

