STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_flash_itf.h
hal_status_t HAL_FLASH_ITF_OB_SetRDPLevel(FLASH_TypeDef *flash, hal_flash_itf_ob_rdp_level_t rdp_level);
hal_flash_itf_ob_rdp_level_t HAL_FLASH_ITF_OB_GetRDPLevel(const FLASH_TypeDef *flash);

hal_status_t HAL_FLASH_ITF_OB_SetRDPOEM1Key(FLASH_TypeDef *flash, hal_flash_itf_ob_rdp_oem_key_t *p_key);
hal_status_t HAL_FLASH_ITF_OB_SetRDPOEM2Key(FLASH_TypeDef *flash, hal_flash_itf_ob_rdp_oem_key_t *p_key);

hal_status_t HAL_FLASH_ITF_OB_SetBORLevel(FLASH_TypeDef *flash, hal_flash_itf_ob_bor_level_t bor_level);
hal_flash_itf_ob_bor_level_t HAL_FLASH_ITF_OB_GetBORLevel(const FLASH_TypeDef *flash);


hal_status_t HAL_FLASH_ITF_OB_SetEnterLowPWRModeRstGeneration(FLASH_TypeDef *flash,
                                                              uint32_t low_pwr_mode,
                                                              hal_flash_itf_ob_rst_generation_status_t rst_gen);
hal_flash_itf_ob_rst_generation_status_t HAL_FLASH_ITF_OB_GetEnterLowPWRModeRstGeneration(const FLASH_TypeDef *flash,
    uint32_t low_pwr_mode);


hal_status_t HAL_FLASH_ITF_OB_SetSystemRstSRAMErase(FLASH_TypeDef *flash,
                                                    uint32_t sram,
                                                    hal_flash_itf_ob_sys_rst_sram_erase_t sram_erase);
hal_flash_itf_ob_sys_rst_sram_erase_t HAL_FLASH_ITF_OB_GetSystemRstSRAMErase(const FLASH_TypeDef *flash,
                                                                             uint32_t sram);

hal_status_t HAL_FLASH_ITF_OB_SetIWDGMode(FLASH_TypeDef *flash, hal_flash_itf_ob_wdg_mode_t mode);
hal_flash_itf_ob_wdg_mode_t HAL_FLASH_ITF_OB_GetIWDGMode(const FLASH_TypeDef *flash);

hal_status_t HAL_FLASH_ITF_OB_SetWWDGMode(FLASH_TypeDef *flash, hal_flash_itf_ob_wdg_mode_t mode);
hal_flash_itf_ob_wdg_mode_t HAL_FLASH_ITF_OB_GetWWDGMode(const FLASH_TypeDef *flash);


hal_status_t HAL_FLASH_ITF_OB_FreezeIWDGCounterLowPWRMode(FLASH_TypeDef *flash, uint32_t low_pwr_mode);
hal_status_t HAL_FLASH_ITF_OB_UnfreezeIWDGCounterLowPWRMode(FLASH_TypeDef *flash, uint32_t low_pwr_mode);
hal_flash_itf_ob_wdg_freeze_status_t HAL_FLASH_ITF_OB_IsFrozenIWDGCounterLowPWRMode(const FLASH_TypeDef *flash,
    uint32_t low_pwr_mode);

hal_status_t HAL_FLASH_ITF_OB_SetBankSwap(FLASH_TypeDef *flash, hal_flash_itf_ob_bank_swap_t bank_swap);
hal_flash_itf_ob_bank_swap_t HAL_FLASH_ITF_OB_GetBankSwap(const FLASH_TypeDef *flash);

hal_status_t HAL_FLASH_ITF_OB_SetBankTopology(FLASH_TypeDef *flash, hal_flash_itf_ob_topology_t bank_topology);
hal_flash_itf_ob_topology_t HAL_FLASH_ITF_OB_GetBankTopology(const FLASH_TypeDef *flash);

hal_status_t HAL_FLASH_ITF_OB_EnableSRAMECC(FLASH_TypeDef *flash, uint32_t sram);
hal_status_t HAL_FLASH_ITF_OB_DisableSRAMECC(FLASH_TypeDef *flash, uint32_t sram);
hal_flash_itf_ob_sram_ecc_status_t HAL_FLASH_ITF_OB_IsEnabledSRAMECC(const FLASH_TypeDef *flash, uint32_t sram);

hal_status_t HAL_FLASH_ITF_OB_SetBootSelection(FLASH_TypeDef *flash,
                                               hal_flash_itf_ob_boot_selection_t boot_select);
hal_flash_itf_ob_boot_selection_t HAL_FLASH_ITF_OB_GetBootSelection(const FLASH_TypeDef *flash);

hal_status_t HAL_FLASH_ITF_OB_SetBoot0(FLASH_TypeDef *flash, hal_flash_itf_ob_boot_state_t state);
hal_flash_itf_ob_boot_state_t HAL_FLASH_ITF_OB_GetBoot0(const FLASH_TypeDef *flash);

hal_status_t HAL_FLASH_ITF_OB_SetIOPull(FLASH_TypeDef *flash,
                                        uint32_t pin,
                                        hal_flash_itf_ob_pull_mode_t pull_mode);
hal_flash_itf_ob_pin_pull_status_t HAL_FLASH_ITF_OB_GetIOPull(const FLASH_TypeDef *flash, uint32_t pin);

hal_status_t HAL_FLASH_ITF_OB_EnableVddxHighSpeedLowVoltage(FLASH_TypeDef *flash, uint32_t vdd);
hal_status_t HAL_FLASH_ITF_OB_DisableVddxHighSpeedLowVoltage(FLASH_TypeDef *flash, uint32_t vdd);
hal_flash_itf_ob_vddx_hslv_status_t HAL_FLASH_ITF_OB_IsEnabledVddxHighSpeedLowVoltage(const FLASH_TypeDef *flash,
    uint32_t vdd);

hal_status_t HAL_FLASH_ITF_OB_EnableTrustZone(FLASH_TypeDef *flash);
hal_status_t HAL_FLASH_ITF_OB_DisableTrustZone(FLASH_TypeDef *flash);
hal_flash_itf_ob_trustzone_status_t HAL_FLASH_ITF_OB_IsEnabledTrustZone(const FLASH_TypeDef *flash);

hal_status_t HAL_FLASH_ITF_OB_SetNSecureBootAddr(FLASH_TypeDef *flash,
                                                 hal_flash_itf_ob_addr_idx_t addr_idx,
                                                 uint32_t boot_addr);
uint32_t HAL_FLASH_ITF_OB_GetNSecureBootAddr(const FLASH_TypeDef *flash, const hal_flash_itf_ob_addr_idx_t addr_idx);
/**
  * @}
  */

/** @defgroup FLASH_ITF_Exported_Functions_Group4 FLASH Interface interrupt management functions
  * @{
  */
void HAL_FLASH_ITF_IRQHandler(FLASH_TypeDef *flash);
void HAL_FLASH_ITF_OB_ProgramCpltCallback(FLASH_TypeDef *flash);
void HAL_FLASH_ITF_OB_ErrorCallback(FLASH_TypeDef *flash);
/**
  * @}
  */

/** @defgroup FLASH_ITF_Exported_Functions_Group5 FLASH Interface option bytes process functions
  * @{
  */
hal_status_t HAL_FLASH_ITF_OB_Program(FLASH_TypeDef *flash);
hal_status_t HAL_FLASH_ITF_OB_Launch(FLASH_TypeDef *flash);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32U5XX_HAL_FLASH_ITF_H */
